/*
скрипт: Set-ExecutionPolicy -ExecutionPolicy Unrestricted -Scope CurrentUser

Теория:
1. https://learn.javascript.ru/operators
2. https://learn.javascript.ru/comparison
3. https://learn.javascript.ru/ifelse
4. https://learn.javascript.ru/while-for#tsikl-for
5. https://doka.guide/js/if-else/
6. https://doka.guide/js/for/


Практика:
1.  Создать функцию, которая на вход принимает массив чисел.
Необходимо вывести в консоль каждое четное число

2. Создать функцию, которая на вход принимает массив чисел.
Необходимо вернуть самое большое число

3. Создать функцию, которая на вход принимает массив чисел длинной минимум 8 элементов.
Необходимо вывести в консоль каждое четное число, кроме третьего и пятого.
Сделать две реализации с if и с continue.

4. Создать функцию, которая на вход принимает массив чисел длинной минимум 8 элементов.
Необходимо вывести в консоль все числа до пятой ячейки.
Сделать две реализации с if, с break.

5. Создать функцию, которая на вход принимает массив чисел.
Необходимо вернуть сумму чисел массива

const testArr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
*/
