/*

Теория:
1. https://learn.javascript.ru/structure#kommentarii
2. https://learn.javascript.ru/variables
3. https://learn.javascript.ru/types#obekty-i-simvoly
4. https://doka.guide/js/var-let/


Практика:
1. Создать 3 переменных x, y, z и присвоить им значения с типом строки, числа и логический тип
2. Создать 3 массива a, b ,c:
    a. Массив состоит только из 3-х чисел, заполнить его произвольные значения
    b. Массив содержит в себе переменные x, y, z
    c. Массив  состоит только из строк, заполняем его произвольным количеством значений
3. Присваиваем переменной x новое значение, которое берем из самой первой ячейки массива с
4. Присваиваем переменной y новое значение, которое берем из последней ячейки массива а
5. Выводим в консоль переменные x и y со старыми значениями, затем с обновленными
6. Протипизировать все переменные

*/